<?php
$N1 = $_POST["N1"];
$N2 = $_POST["N2"];
$N3 = $_POST["N3"];
$N4 = $_POST["N4"];
$N5 = $_POST["N5"];
$N6 = $_POST["N6"];
$N7 = $_POST["N7"];
$N8 = $_POST["N8"];
$N9 = $_POST["N9"];
$N10 = $_POST["N10"];


if ($N1 == 0) {
    $i++;
}
if ($N2 == 0) {
    $i++;
}
if ($N3 == 0) {
    $i++;
}
if ($N4 == 0) {
    $i++;
}
if ($N5 == 0) {
    $i++;
}
if ($N6 == 0) {
    $i++;
}
if ($N7 == 0) {
    $i++;
}
if ($N8 == 0) {
    $i++;
}
if ($N9 == 0) {
    $i++;
}
if ($N10 == 0) {
    $i++;
}
if ($i >= 5) {
    echo "Тест успешно пройден";
} else {
    echo "Вы не прошли тест";
}
