-- phpMyAdmin SQL Dump
-- version 5.0.4
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Мар 10 2021 г., 19:31
-- Версия сервера: 8.0.19
-- Версия PHP: 8.0.1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `prais`
--

-- --------------------------------------------------------

--
-- Структура таблицы `moloko`
--

CREATE TABLE `moloko` (
  `id` int NOT NULL,
  `Группа` varchar(50) DEFAULT NULL,
  `Наименование продукции` varchar(50) DEFAULT NULL,
  `Упаковка` varchar(50) DEFAULT NULL,
  `Масса, гр` int DEFAULT NULL,
  `Срок годности, мес` int DEFAULT NULL,
  `Цена, бел.руб` float DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `moloko`
--

INSERT INTO `moloko` (`id`, `Группа`, `Наименование продукции`, `Упаковка`, `Масса, гр`, `Срок годности, мес`, `Цена, бел.руб`) VALUES
(1, 'молочные консервы', 'Молоко сгущённое с сахаром м.д.ж. 5%', 'ж/б', 385, 12, 2),
(2, 'молочные консервы', 'Молоко цельное сгущённое с сахаром м.д.ж. 8,5% ', 'ж/б', 380, 18, 1.8),
(3, 'молочные консервы', 'Молоко цельное сгущённое с сахаром м.д.ж. 8,5% ', 'туба', 160, 12, 1.04),
(4, 'молочные консервы', 'Молоко цельное сгущённое с сахаром м.д.ж. 8,5% ', 'дой-пак', 280, 12, 1.44),
(5, 'молочные консервы', 'Молоко сгущённое с сахаром и ароматом м.д.ж. 8,5% ', 'туба', 160, 6, 1.07),
(6, 'молочные консервы', 'Молоко сгущённое с сахаром и ароматом м.д.ж. 8,5% ', 'ж/б', 380, 6, 1.84),
(7, 'масло', 'Масло сладкосливочное несоленое м.д.ж. 72,5%, в/с', 'весовое', 1000, 15, 13.48),
(8, 'масло', 'Масло сладкосливочное несоленое м.д.ж. 72,5%, в/с', 'фасованное', 180, 2, 2.47),
(9, 'масло', 'Масло сладкосливочное несоленое м.д.ж. 82,5%, в/с', 'фасованное', 180, 2, 2.8),
(10, 'масло', 'Масло сладкосливочное несоленое м.д.ж. 82,5%, в/с', 'весовое', 1000, 15, 15.35),
(11, 'сухое молоко', 'Молоко сухое м.д.ж. 25% Сорт \"Стандарт\"', 'фасованное', 250, 24, 2.36),
(12, 'сухое молоко', 'Молоко сухое м.д.ж. 25% Сорт \"Стандарт\"', 'фасованное', 500, 24, 4.73),
(13, 'сухое молоко', 'Сыворотка молочная сухая', 'весовая', 1000, 6, 2.3);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `moloko`
--
ALTER TABLE `moloko`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `moloko`
--
ALTER TABLE `moloko`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
