<?
/*
------- *** Автор программы: Голубев Сергей *** ---------
Связь (dubkidubki@list.ru) Джедай.
Начало разработки - конец 2004 года.
Читаем Пользовательское соглашение и Readme!
Полностью бесплатный продукт! Авторские права защищены законом!
*/
$title="Jedic`s PHP > Jedic_Guestbook v.$vers"; // Имя гостевой книги. Можете изменить (Jedic_Guestbook v.$vers) например на: (гостевая Ивана. )
$width='430'; // ширина гостевой книги
$adminc='#fffddd'; // цвет текста админских коментариев
$smile_c='20'; // смайлов в строке.
?>